{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "/data1/student/czy/LLaMA-Factory/models/qwen/Qwen2.5-VL-7B-Instruct",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "layers.9.mlp.gate_proj",
    "o_proj",
    "layers.23.mlp.down_proj",
    "layers.4.mlp.up_proj",
    "layers.18.mlp.down_proj",
    "layers.20.mlp.down_proj",
    "layers.1.mlp.down_proj",
    "layers.24.mlp.up_proj",
    "layers.5.mlp.up_proj",
    "layers.9.mlp.down_proj",
    "layers.18.mlp.up_proj",
    "layers.4.mlp.down_proj",
    "layers.1.mlp.up_proj",
    "layers.24.mlp.down_proj",
    "layers.4.mlp.gate_proj",
    "layers.25.mlp.down_proj",
    "layers.17.mlp.down_proj",
    "layers.19.mlp.down_proj",
    "layers.7.mlp.up_proj",
    "layers.3.mlp.up_proj",
    "layers.16.mlp.up_proj",
    "layers.12.mlp.up_proj",
    "layers.12.mlp.gate_proj",
    "layers.17.mlp.gate_proj",
    "layers.16.mlp.gate_proj",
    "layers.21.mlp.up_proj",
    "layers.0.mlp.down_proj",
    "layers.6.mlp.gate_proj",
    "layers.16.mlp.down_proj",
    "layers.9.mlp.up_proj",
    "k_proj",
    "layers.25.mlp.gate_proj",
    "layers.19.mlp.gate_proj",
    "layers.19.mlp.up_proj",
    "layers.7.mlp.down_proj",
    "layers.6.mlp.up_proj",
    "layers.23.mlp.up_proj",
    "layers.26.mlp.down_proj",
    "layers.8.mlp.gate_proj",
    "layers.11.mlp.down_proj",
    "layers.0.mlp.up_proj",
    "layers.3.mlp.gate_proj",
    "layers.2.mlp.up_proj",
    "layers.22.mlp.down_proj",
    "layers.20.mlp.up_proj",
    "layers.26.mlp.up_proj",
    "layers.13.mlp.down_proj",
    "layers.14.mlp.up_proj",
    "layers.5.mlp.gate_proj",
    "layers.22.mlp.gate_proj",
    "layers.15.mlp.gate_proj",
    "layers.8.mlp.up_proj",
    "layers.27.mlp.up_proj",
    "layers.17.mlp.up_proj",
    "layers.18.mlp.gate_proj",
    "layers.6.mlp.down_proj",
    "layers.5.mlp.down_proj",
    "layers.10.mlp.gate_proj",
    "layers.14.mlp.gate_proj",
    "layers.2.mlp.down_proj",
    "layers.11.mlp.up_proj",
    "layers.11.mlp.gate_proj",
    "layers.1.mlp.gate_proj",
    "layers.13.mlp.gate_proj",
    "v_proj",
    "layers.14.mlp.down_proj",
    "layers.15.mlp.down_proj",
    "layers.27.mlp.gate_proj",
    "layers.13.mlp.up_proj",
    "layers.15.mlp.up_proj",
    "layers.12.mlp.down_proj",
    "layers.7.mlp.gate_proj",
    "layers.26.mlp.gate_proj",
    "layers.23.mlp.gate_proj",
    "layers.2.mlp.gate_proj",
    "layers.24.mlp.gate_proj",
    "layers.8.mlp.down_proj",
    "layers.20.mlp.gate_proj",
    "layers.0.mlp.gate_proj",
    "layers.21.mlp.down_proj",
    "layers.22.mlp.up_proj",
    "layers.25.mlp.up_proj",
    "layers.10.mlp.up_proj",
    "q_proj",
    "layers.3.mlp.down_proj",
    "layers.10.mlp.down_proj",
    "layers.21.mlp.gate_proj",
    "layers.27.mlp.down_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}